/*******************************************************************************
** 文件名: 		sys_debug.c
** 版本：  		1.0
** 工作环境: 	RealView MDK-ARM
** 作者: 		Adam
** 功能:		debug相关程序
** 相关文件:		无
** 修改日志：	2017-02-12   创建文档
*******************************************************************************/
/* 包含的头文件 --------------------------------------------------------------*/
#include <stdarg.h>
#include <stdio.h>


#include "sys_debug.h"

#if DEBUG_ENABLE

/* 变量定义  -----------------------------------------------------------------*/
static char print_buff[200];//输出缓存

/* 函数声明  -----------------------------------------------------------------*/
extern void usart_send_str(const char *str);//串口输出函数


/*------------------------------------------------------------------------------
函数名称：dbg_print
函数功能：Debug输出信息
入口参数：format：格式,...：参数
出口参数：无
备 注：无
-----------------------------------------------------------------------------*/
void dbg_print(const char *format, ...)
{
    struct __va_list ap;
    va_start(ap, format);
    vsprintf(print_buff,format, ap);
    va_end(ap);
    usart_send_str(print_buff);
    return ;
}

#endif

/************************************文件结束**********************************/
