/*******************************************************************************
** 文件名: 		sys_timer.h
** 版本：  		1.0
** 工作环境: 	RealView MDK-ARM
** 作者: 		Adam
** 生成日期: 	2017-02-12
** 功能:		时间相关程序
** 相关文件:		无
** 修改日志：	2017-02-12   创建文档
*******************************************************************************/
/* 防止重定义-----------------------------------------------------------------*/
#ifndef _CORE_TIMER_H
#define _CORE_TIMER_H
/* 包含的头文件---------------------------------------------------------------*/
#include "sys_core.h"

/* 类型定义 ------------------------------------------------------------------*/
struct software_timer//软件定时器
{
	volatile s16 cycle_residue;//剩余次数
	volatile u16 counter;//时间计数
	volatile u16 period;//周期
	volatile u16 compare;//比较值
};

enum
{
    TimerOff=0,//关闭软件定时器
    TimerOn=-1,//软件定时器常开
};

/* 变量声明-------------------------------------------------------------------*/
extern volatile __int64 run_time_ms;//设备运行时间，单位:ms

/* 函数声明-------------------------------------------------------------------*/
void delay_init(u8 SYSCLK);
void delay_ms(u32 time_ms);//延时函数
void delay_us(u32 nus);//延时函数

#endif

/************************************文件结束**********************************/
