/*******************************************************************************
** 文件名: 		sys_config.h
** 版本：  		1.0
** 工作环境: 	RealView MDK-ARM
** 作者: 		Adam
** 生成日期: 	2017-02-12
** 功能:		系统配置文件
** 相关文件:		无
** 修改日志：	2017-02-12   创建文档
*******************************************************************************/
/* 防止重定义-----------------------------------------------------------------*/
#ifndef _CORE_SYS_CONFIG_H
#define _CORE_SYS_CONFIG_H
/* 宏定义---------------------------------------------------------------------*/
#define RTOS_ENABLE  1//使用操作系统
#define DEBUG_ENABLE 0//Debug使能
#define WDG_ENABLE   0//看门狗使能
 
#define NEW_DCA8562 1//设置DAC 新方案 
#endif

/************************************文件结束*********************************/
