/*******************************************************************************
** 文件名:      SysConfig.h
** 版本：       1.0
** 工作环境:    RealView MDK-ARM
** 作者:        Adam
** 生成日期:    2017-02-12
** 功能:        系统核心头文件
** 相关文件:    无
** 修改日志：	2017-02-12   创建文档
*******************************************************************************/
/* 防止重定义-----------------------------------------------------------------*/
#ifndef _CORE_SYS_CORE_H
#define _CORE_SYS_CORE_H
/* 包含的头文件---------------------------------------------------------------*/
#include "sys_config.h"

#include "sys_type.h"
#include "sys_timer.h"
#include "sys_wdg.h"
#include "sys_debug.h"

#endif

/************************************文件结束*********************************/
